{
  "items": [
    {
      "title": "Research Engineer &#8211; Interactive Consultant, current",
      "company": "Travis Mullen",
      "url": "https://https://travismullen.com/",
      "shortUrl": "travismullen.com",
      "location": "Orlando",
      "desc": [
        "Exploring ways to enhance user interfaces and overall experience using various frameworks and native browser features.",
        "Building optimized web applications with componentization, state management, and feature/unit testing, or strategizing updates to preexisting applications as partitioned releases or hybrid apps. Helping reduce the amount of projects that depend on AngularJS and Bootstrap.",
        "Investigating and implementing experimental NodeJS features, modular JavaScript, and the newest ECMAScript additions.",
        "Authoring NPM packages using Rollup, instead of Webpack, so they can be built as “modern JavaScript” and not bloated CommonJS or UDM. Occasional monorepo management using Lerna." ,
        "Blockchain application development, writing smart contracts, and node build/maintenance tools.",
        "Full-stack security research including hardening and automating Linux servers, auditing web applications, and encrypting IoT intranet communication."
      ]
    },
    {
      "title": "Full-stack Engineer, 6/17 &#8211; 1/19",
      "company": "Turnberry Solutions",
      "url": "https://turnberrysolutions.com",
      "shortUrl": "turnberrysolutions.com",
      "location": "Philadelphia",
      "desc": "Worked on-site, at Comcast Center, for the Experience Platform Team (XPT) to enhance and optimize their suite of web application products. Developed a design system to standardize and implement common interface elements throughout the products as framework agnostic components using native browser CustomElementRegistry. A goal of the design system was to allow the design team to rapid prototype and bridge the gap between the design vision and actual development implementation.",
      "tech": "[ZURB Foundation 5, AngularJS, CSS, SVG, Gulp]"
    },
    {
      "title": "UX Lead, 11/16 &#8211; 6/17<br /> Interactive Consultant, 8/14 &#8211; 11/16",
      "company": "Viridity Energy",
      "url": "https://viridityenergy.com",
      "shortUrl": "viridityenergy.com",
      "location": "Philadelphia",
      "desc": "Responsive design architecture and development of single page applications, automated email templating system and brochure site.",
      "tech": "[ZURB Foundation 5, AngularJS, CSS, SVG, Gulp]"
    },
    {
      "title": "Interactive Consultant, 12/13 &#8211; 4/14",
      "company": "EPAM Empathy Lab",
      "url": "https://epam.com",
      "shortUrl": "epam.com",
      "location": "Conshohocken, PA",
      "desc": "Responsive design architecture and development.",
      "tech": "[ZURB Foundation 4, HTML5, CSS, jQuery]"
    },
    {
      "title": "Interactive Consultant, 12/12 &#8211; 3/13",
      "company": "MRM Mccann",
      "url": "https://mrm-mccann.com/",
      "shortUrl": "mrm-mccann.com",
      "location": "Princeton, NJ",
      "desc": "Template development for both desktop and mobile devices that incorporate responsive design.",
      "tech": "[HTML5, CSS, JQuery, Mobile]"
    },
    {
      "title": "Interactive Consultant, 6/09 &#8211; 10/12",
      "company": "True Action, an eBay Inc Company",
      "url": "https://ebay.com",
      "shortUrl": "trueaction.com",
      "location": "King of Prussia",
      "desc": "Responsible for production support and enhancements for many online retail and corporate brochure sites. Managed projects and resources.",
      "tech": "[HTML5, CSS, JQuery, JSP, JSTL, PHP]"
    }
  ]
}